# Calendar Full DB Pre-Processing

#### Goals:
- Add 'city' as a feature. 
- Exchange prices to Euros.
- Concatenate databases

In [2]:
import pandas as pd
import numpy as np
import os

In [4]:
root = r"C:\Users\aleen\Desktop\Master Thesis\Data\CALENDAR\\"
city_category_list = ['amsterdam', 'athens', 'berlin', 'copenhagen', 'london', 'madrid', 'paris', 'prague', 'rome', 'vienna']

amsterdam = pd.read_csv(root + city_category_list[0] + "_calendar.csv")
athens = pd.read_csv(root + city_category_list[1] + "_calendar.csv")
berlin= pd.read_csv(root + city_category_list[2] + "_calendar.csv")
copenhagen = pd.read_csv(root + city_category_list[3] + "_calendar.csv")
london = pd.read_csv(root + city_category_list[4] + "_calendar.csv")
madrid = pd.read_csv(root + city_category_list[5] + "_calendar.csv")
paris = pd.read_csv(root + city_category_list[6] + "_calendar.csv")
prague = pd.read_csv(root + city_category_list[7] + "_calendar.csv")
rome = pd.read_csv(root + city_category_list[8] + "_calendar.csv")
vienna = pd.read_csv(root + city_category_list[9] + "_calendar.csv")

In [5]:
df_list = [amsterdam, athens, berlin, copenhagen, london, madrid, paris, prague, rome, vienna]

In [6]:
i = 0
for df in df_list:
    df['city'] = city_category_list[i]
    i += 1

In [7]:
def convert_to_euro(amount,currency):
    '''
    This converter uses no API at the moment. Just need to update the currency rate list.
    You input the amount of currency you want to convert and the currency you convert to.
    '''
    rates = [(0.13,"DKK"),(1.10,"GBP"),(1.0,"EUR"),(0.037,'CZK')]

    def getall(my_list, s):
        index = [x for x, y in my_list if y==s] # Very versatile. 
        return (index[0])

    rate = getall(rates, currency)
    out = amount * rate
    return (out)

In [10]:
def convert_prices_in_dataframe(df, local_currency):
    prices_list = ['average_price']
    for p in prices_list:
        df[p] = df.apply(lambda x: convert_to_euro(x[p], local_currency), axis=1)

In [11]:
convert_prices_in_dataframe(copenhagen, 'DKK')
convert_prices_in_dataframe(london, 'GBP')
convert_prices_in_dataframe(prague, 'CZK')

In [12]:
df_final = pd.concat(df_list, ignore_index=True)

In [13]:
df_final.shape

(17511, 4)

In [14]:
df_final.head()

         date  average_price      date.1       city
0  2015-04-05     174.631944  2015-04-05  amsterdam
1  2015-04-06     160.257013  2015-04-06  amsterdam
2  2015-04-07     157.153369  2015-04-07  amsterdam
3  2015-04-08     161.443290  2015-04-08  amsterdam
4  2015-04-09     159.940822  2015-04-09  amsterdam

In [19]:
df_final.sample(5)

             date  average_price      date.1       city
8099   2018-07-11     143.102521  2018-07-11     london
13926  2020-10-23     128.187719  2020-10-23     prague
3676   2020-09-27     112.557644  2020-09-27     athens
1363   2018-12-28     782.899752  2018-12-28  amsterdam
12135  2018-10-23     163.947362  2018-10-23      paris

In [20]:
df_final.to_csv(r"C:\Users\aleen\Desktop\Master Thesis\Data\CALENDAR\EUROPE_CALENDAR.csv")